Autodesk.Revit.DB.FamilyInstance.SetCopingIds(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Specifies the set of coping cutters on this element.
cutters: A set of coping cutters (steel beams and steel columns).
Remarks:  The set may be null or empty, but may not contain the element being coped.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when 'cutters' contains this instance.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when regeneration fails or if a cutter element is not a FamilyInstance.

Autodesk.Revit.DB.FamilyInstance.HostParameter
If the instance is hosted by a wall, this property returns the parameter value of the insertion
point of the instance along the wall's location curve.
Remarks: This works for instances with a host element that is of type Wall or is in the OST_Walls category only, including in-place ones.